In [2]:
import pandas as pd

In [3]:
the_world_ranking = pd.read_csv('../the_world_ranking.csv')
the_world_ranking.head()

,Rank,Name,Overall,Teaching,Research Environment,Research Quality,Industry,International Outlook,col_0
0,1,University of Oxford\nUnited Kingdom,98.2,97.2,100.0,97.7,99.9,96.4,NaN
1,2,Massachusetts Institute of Technology\nUnited ...,97.7,99.2,95.3,99.6,100.0,91.9,NaN
2,=3,Princeton University\nUnited States,97.2,98.2,97.3,99.0,98.0,85.4,NaN
3,=3,University of Cambridge\nUnited Kingdom,97.2,96.2,99.9,97.1,87.6,96.3,NaN
4,=5,Harvard University\nUnited States,97.1,95.9,100.0,98.9,86.7,88.3,NaN

In [4]:
df = the_world_ranking.copy()


df[['University Name', 'Country']] = df['Name'].str.split(pat='\n', n=1, expand=True)
df['University Name'] = df['University Name'].str.strip()
df['Country'] = df['Country'].str.strip()


df['Overall Rank or Rank Band'] = df['Rank'].astype(str).str.replace(r'^=', '', regex=True).str.strip()

df = df.rename(columns={
    'Teaching': 'Teaching Score',
    'Research Environment': 'Research Environment Score',
    'Research Quality': 'Research Quality Score',
    'International Outlook': 'International Outlook Score',
    'Industry': 'Industry or Income Score'
})

cols = [
    'University Name',
    'Country',
    'Overall Rank or Rank Band',
    'Teaching Score',
    'Research Environment Score',
    'Research Quality Score',
    'International Outlook Score',
    'Industry or Income Score'
]
cleaned_rankings = df[cols]

cleaned_rankings.head()

,University Name,Country,Overall Rank or Rank Band,Teaching Score,Research Environment Score,Research Quality Score,International Outlook Score,Industry or Income Score
0,University of Oxford,United Kingdom,1,97.2,100.0,97.7,96.4,99.9
1,Massachusetts Institute of Technology,United States,2,99.2,95.3,99.6,91.9,100.0
2,Princeton University,United States,3,98.2,97.3,99.0,85.4,98.0
3,University of Cambridge,United Kingdom,3,96.2,99.9,97.1,96.3,87.6
4,Harvard University,United States,5,95.9,100.0,98.9,88.3,86.7

In [5]:
initial_count = len(cleaned_rankings)
cleaned_rankings.dropna(subset=cols, inplace=True)
cleaned_rankings.reset_index(drop=True, inplace=True)
print(f"Removed {initial_count - len(cleaned_rankings)} rows with null values")
cleaned_rankings.head()

Removed 928 rows with null values

C:\Users\MY PC\AppData\Local\Temp\ipykernel_3176\1939398974.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_rankings.dropna(subset=cols, inplace=True)

,University Name,Country,Overall Rank or Rank Band,Teaching Score,Research Environment Score,Research Quality Score,International Outlook Score,Industry or Income Score
0,University of Oxford,United Kingdom,1,97.2,100.0,97.7,96.4,99.9
1,Massachusetts Institute of Technology,United States,2,99.2,95.3,99.6,91.9,100.0
2,Princeton University,United States,3,98.2,97.3,99.0,85.4,98.0
3,University of Cambridge,United Kingdom,3,96.2,99.9,97.1,96.3,87.6
4,Harvard University,United States,5,95.9,100.0,98.9,88.3,86.7

In [6]:
cleaned_rankings.to_csv('../cleaned_world_ranking.csv', index=False)